app/controllers/admin/dashboards_controller.rb

SELECT "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."dashboard_id" = 6
---
  def destroy
    @dashboard = Dashboard.find(params[:id])
    @dashboardwidgets = DashboardWidget.where(dashboard_id: params[:id])