app/controllers/admin/dashboards_controller.rb

  def index
    get_collections

    if @dashboards.present?
    dashboard_widgets = DashboardWidget.where(dashboard_id: @dashboard.id)
    dashboard_widgets.each do |dw|
---
SELECT  "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."dashboard_id" = 6 LIMIT 1
SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @dashboard = Dashboard.new(dashboard_params)
    if @dashboard.valid?
      @dashboard.save
---
INSERT INTO "dashboards" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-06-15 03:51:12.361699"], ["name", "aaa"], ["updated_at", "2015-06-15 03:51:12.361699"], ["user_id", 2]]

  def edit
    @dashboard = Dashboard.find(params[:id])
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 4]]

  def show
    @dashboard = Dashboard.find(params[:id])
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 6]]

  def update
    @dashboard = Dashboard.find(params[:id])
    @dashboards = Dashboard.order("created_at desc").paginate(:page => params[:page], :per_page => 3)
    if @dashboard.valid?
      @dashboard.update_attributes(dashboard_params)
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "dashboards" SET "name" = $1, "updated_at" = $2 WHERE "dashboards"."id" = 4  [["name", "dsfdsf"], ["updated_at", "2015-04-10 09:18:10.537153"]]

  def destroy
    @dashboard = Dashboard.find(params[:id])
    @dashboard.destroy
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "dashboards" WHERE "dashboards"."id" = $1  [["id", 6]]