app/controllers/admin/dashboard_widgets_controller.rb

  def new
    @dashboard = Dashboard.find_by_id params[:dashboard_id]
    @dw = DashboardWidget.all
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = 4 LIMIT 1
SELECT "dashboard_widgets".* FROM "dashboard_widgets"
SELECT "widgets".* FROM "widgets"

  def create
    @dashboard = Dashboard.find_by_id params[:dashboard_id]
    @dashboard_widget = DashboardWidget.new
    if widget_params.present?
      @dashboard_widget.savewidgets(widget_params, @dashboard)
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = 5 LIMIT 1
INSERT INTO "dashboard_widgets" ("created_at", "dashboard_id", "updated_at", "widget_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-04-10 10:27:59.100898"], ["dashboard_id", 5], ["updated_at", "2015-04-10 10:27:59.100898"], ["widget_id", 3]]

  def edit
    @dashboard = Dashboard.find_by_id params[:dashboard_id]
    @widget = Widget.find_by_id params[:id]
    @dashboard_widget = DashboardWidget.find params[:widget_id]
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = 5 LIMIT 1
SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = 3 LIMIT 1
SELECT  "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."id" = $1 LIMIT 1  [["id", 17]]

  def update
    @dashboard_widget = DashboardWidget.find_by_id(params[:id])
    @widget = Widget.find_by_id(@dashboard_widget.widget_id)
    @dashboard = Dashboard.find_by_id params[:dashboard_id]
    @dashboard_widget.access_token = params[:dashboard_widget][:access_token]
    @dashboard_widget.organization_name = params[:dashboard_widget][:organization_name]
    @dashboard_widget.repo_name = params[:dashboard_widget][:repo_name]
    @dashboard_widget.status = params[:dashboard_widget][:status]
    @dashboard_widget.github_url = params[:dashboard_widget][:github_url]
    @dashboard_widget.code_api_token = params[:dashboard_widget][:code_api_token]
    @dashboard_widget.code_repo_id = params[:dashboard_widget][:code_repo_id]
    @dashboard_widget.jira_url = params[:dashboard_widget][:jira_url]
    @dashboard_widget.jira_view_id = params[:dashboard_widget][:jira_view_id]
    @dashboard_widget.jira_name = params[:dashboard_widget][:jira_name]
    @dashboard_widget.jira_password = params[:dashboard_widget][:jira_password]
    @dashboard_widget.jira_project_key = params[:dashboard_widget][:jira_project_key]
    @dashboard_widget.github_status_prs = params[:dashboard_widget][:github_status_prs]
    @dashboard_widget.status = "configured"
    if @dashboard_widget.valid?
     @dashboard_widget.save
---
SELECT  "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."widget_id" = 3 LIMIT 1
SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = 3 LIMIT 1
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = 7 LIMIT 1
UPDATE "dashboard_widgets" SET "access_token" = $1, "organization_name" = $2, "repo_name" = $3, "status" = $4, "updated_at" = $5 WHERE "dashboard_widgets"."id" = 17  [["access_token", "aa"], ["organization_name", "a"], ["repo_name", "a"], ["status", "configured"], ["updated_at", "2015-06-15 03:51:38.224050"]]

 def destroy
  @dashboard = Dashboard.find_by_id params[:dashboard_id]
  @widget = Widget.find_by_id params[:id]
  @dashboard_widget = DashboardWidget.find_by_widget_id @widget.id
  @dashboard_widget.destroy
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = 6 LIMIT 1
SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = 8 LIMIT 1
SELECT  "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."widget_id" = 8 LIMIT 1
DELETE FROM "dashboard_widgets" WHERE "dashboard_widgets"."id" = $1  [["id", 11]]