app/controllers/admin/dashboard_widgets_controller.rb

DELETE FROM "dashboard_widgets" WHERE "dashboard_widgets"."id" = $1  [["id", 2]]
---
  def create
    @dashboard = Dashboard.find_by_id params[:dashboard_id]
    @dashboard.widgets.destroy_all