app/controllers/admin/updates_controller.rb

	def index
    	@qwinix_update = QwinixUpdates.last
---
SELECT  "qwinix_updates".* FROM "qwinix_updates"   ORDER BY "qwinix_updates"."id" DESC LIMIT 1

	def create
		@qwinix_update = QwinixUpdates.new(update_params)
    if @qwinix_update.valid?
      @qwinix_update.save
---
INSERT INTO "qwinix_updates" ("created_at", "description", "updated_at", "widget_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-06-15 03:47:00.477769"], ["description", "<p>aaa</p>"], ["updated_at", "2015-06-15 03:47:00.477769"], ["widget_name", "aa"]]