app/controllers/admin/users_controller.rb

	def index
		@users = User.order("created_at desc").paginate(:page => params[:page], :per_page => 3)
---
SELECT  "users".* FROM "users"   ORDER BY created_at desc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "users"

  def unique_email
    @user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'sjayaramu@qwinixtech.com' LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.add_role :admin
      @user.save
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-06-10 11:25:33.598865"], ["name", "admin"], ["updated_at", "2015-06-10 11:25:33.598865"]]
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-04-15 05:06:52.808533"], ["name", "kkkkkkkkkkkkkkkkk"], ["updated_at", "2015-04-15 05:06:52.808533"]]