app/views/admin/dashboard_widgets/_form.html.erb

          </div>
          <% dashwidgets = DashboardWidget.where(dashboard_id: @dashboard.id).pluck(:widget_id) %>
---
SELECT "dashboard_widgets"."widget_id" FROM "dashboard_widgets"  WHERE "dashboard_widgets"."dashboard_id" = 6

                <input type="checkbox">
                <div><%= check_box_tag "jirawidget[]", widget.id,@dashboard.widgets.include?(widget) %><%= widget.name %></div>
---
SELECT  1 AS one FROM "widgets" INNER JOIN "dashboard_widgets" ON "widgets"."id" = "dashboard_widgets"."widget_id" WHERE "dashboard_widgets"."dashboard_id" = $1 AND "widgets"."id" = 1 LIMIT 1  [["dashboard_id", 4]]
SELECT "widgets".* FROM "widgets"