app/views/admin/dashboards/_show.html.erb

SELECT "dashboard_widgets".* FROM "dashboard_widgets"  WHERE "dashboard_widgets"."dashboard_id" = 3
---
      </div>
      <%  @widgets = DashboardWidget.where(:dashboard_id => @dashboard.id) %>

SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = $1 LIMIT 1  [["id", 3]]
---
          <div class="col-sm-7">
            <a><%= Widget.find(w.widget_id).widget_type %> - <%= Widget.find(w.widget_id).name %></a>