app/views/admin/dashboards/_wallboard_button.html.erb

  <%= link_to 'Add New Dashboard', new_admin_dashboard_path, :remote => true, :class=>"btn btn-primary" %>
  <%= link_to 'Wallboard', admin_dashboard_dashing_path(@dashboard), :class=>"btn btn-primary", :target=>"_blank", :disabled => !(DashboardWidget.where(dashboard_id: @dashboard.id).pluck(:status).include?("configured")) %>
---
SELECT "dashboard_widgets"."status" FROM "dashboard_widgets"  WHERE "dashboard_widgets"."dashboard_id" = 6