app/views/dashing/dashboards/sample.html.erb

<div class="gridster">
<% dashboard = Dashboard.find(params[:dashboard_id])%>
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 7]]

    <% @json_obj.each do |obj| %>
    <% case (Widget.find obj["widget_id"]).name %>
---
SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = $1 LIMIT 1  [["id", 2]]